{
  "id": "165a4de4-3898-11ea-a137-2e728ce88125",
  "meta": {
    "name": "U-Net",
    "application_area": "Image Segmentation",
    "task": "Image Segmentation",
    "task_extended": "Domain Transformation (Similar to CycleGAN)",
    "data_type": "2D images",
    "data_source": "private"
  },
  "publication": {
    "title": "U-Net: Convolutional Networks for Biomedical Image Segmentation",
    "source": "arXiv",
    "year": "2015",
    "authors": "Olaf Ronneberger, Philipp Fischer, Thomas Brox",
    "email": " ronneber@informatik.uni-freiburg.de",
    "abstract": "There is large consent that successful training of deep networks requires many thousand annotated training samples. In this paper, we present a network and training strategy that relies on the strong use of data augmentation to use the available annotated samples more efficiently. The architecture consists of a contracting path to capture context and a symmetric expanding path that enables precise localization. We show that such a network can be trained end-to-end from very few images and outperforms the prior best method (a sliding-window convolutional network) on the ISBI challenge for segmentation of neuronal structures in electron microscopic stacks. Using the same network trained on transmitted light microscopy images (phase contrast and DIC) we won the ISBI cell tracking challenge 2015 in these categories by a large margin. Moreover, the network is fast. Segmentation of a 512x512 image takes less than a second on a recent GPU. The full implementation (based on Caffe) and the trained networks are available at https://lmb.informatik.uni-freiburg.de/people/ronneber/u-net/",
    "url": "https://arxiv.org/abs/1505.04597",
    "google_scholar": "https://scholar.google.de/citations?user=7jrO1NwAAAAJ&hl=en",
    "bibtex": "@inproceedings{ronneberger2015u,   title={U-net: Convolutional networks for biomedical image segmentation},  author={Ronneberger, Olaf and Fischer, Philipp and Brox, Thomas},  booktitle={International Conference on Medical image computing and computer-assisted intervention},  pages={234--241},  year={2015},  organization={Springer}"
  ,
  "model": {
    "description": "U-Net is a convolutional neural network that was developed for biomedical image segmentation at the Computer Science Department of the University of Freiburg, Germany.[1] The network is based on the fully convolutional network[2] and its architecture was modified and extended to work with fewer training images and to yield more precise segmentations. Segmentation of a 512×512 image takes less than a second on a modern GPU.",
    "provenance": "https://github.com/zhixuhao/unet",
    "architecture": "Convolutional Neural Network (CNN)",
    "learning_type": "Supervised Learning",
    "format": ".h5",
    "io": {
      "input": {
        "format": ["image/png", "image/jpg", "image/jpeg"],
        "single":{
          "format": ["image/png", "image/jpg", "image/jpeg"],
          "dim_limits": [
          {
            "min": 1,
            "max": 5
          },
          {
            "min": 200
          },
          {
            "min": 200
          }
        ],
         "description":"Min input size for network input given"
        },
        "description": "Min input size for network input given"
      },
      "output": [
        {
          "name": "binary map after segmentation",
          "type": "image 	2d grayscale",
          "description": "256*256 segmented binary-map image"
        }
      ]
    }
  },
  "modelhub": {
      "top": "??",
      "sort":"true"
  }
}
